<details ><summary>plan for ruby-getting-started-terraform 2026-01-01 09:10:25 (UTC)</summary>
        <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_iam_role.rds_backup will be created
  + resource "aws_iam_role" "rds_backup" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "export.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ruby-getting-started-rds-backup-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-backup-role"
          + "Project"     = "ruby-getting-started"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-backup-role"
          + "Project"     = "ruby-getting-started"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.rds_s3_export will be destroyed
  # (because aws_iam_role.rds_s3_export is not in configuration)
  - resource "aws_iam_role" "rds_s3_export" {
      - arn                   = "arn:aws:iam::786832920677:role/ruby-getting-started-rds-s3-export-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "export.rds.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2026-01-01T08:55:04Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ruby-getting-started-rds-s3-export-role" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ruby-getting-started-rds-s3-export-role" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "production"
          - "Name"        = "ruby-getting-started-rds-s3-export-role"
          - "Project"     = "ruby-getting-started"
        } -> null
      - tags_all              = {
          - "Environment" = "production"
          - "Name"        = "ruby-getting-started-rds-s3-export-role"
          - "Project"     = "ruby-getting-started"
        } -> null
      - unique_id             = "AROA3OMXFSBSVXJLJGJMQ" -> null

      - inline_policy {
          - name   = "ruby-getting-started-rds-s3-export-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "s3:PutObject",
                              - "s3:GetObject",
                              - "s3:ListBucket",
                              - "s3:DeleteObject",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::ruby-getting-started-rds-backup-20251230",
                              - "arn:aws:s3:::ruby-getting-started-rds-backup-20251230/*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.rds_backup will be created
  + resource "aws_iam_role_policy" "rds_backup" {
      + id          = (known after apply)
      + name        = "ruby-getting-started-rds-backup-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.rds_s3_export will be destroyed
  # (because aws_iam_role_policy.rds_s3_export is not in configuration)
  - resource "aws_iam_role_policy" "rds_s3_export" {
      - id     = "ruby-getting-started-rds-s3-export-role:ruby-getting-started-rds-s3-export-policy" -> null
      - name   = "ruby-getting-started-rds-s3-export-policy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:ListBucket",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::ruby-getting-started-rds-backup-20251230",
                          - "arn:aws:s3:::ruby-getting-started-rds-backup-20251230/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "ruby-getting-started-rds-s3-export-role" -> null
    }

  # aws_kms_alias.rds_backup will be created
  + resource "aws_kms_alias" "rds_backup" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/ruby-getting-started-rds-backup"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.rds_backup will be created
  + resource "aws_kms_key" "rds_backup" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "KMS key for RDS backup encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-backup-key"
          + "Project"     = "ruby-getting-started"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-backup-key"
          + "Project"     = "ruby-getting-started"
        }
    }

  # aws_kms_key_policy.rds_backup will be created
  + resource "aws_kms_key_policy" "rds_backup" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::786832920677:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                          + "kms:GenerateDataKey",
                          + "kms:CreateGrant",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "export.rds.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow RDS to use the key"
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                          + "kms:GenerateDataKey",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow S3 to use the key"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_s3_bucket.rds_backup must be replaced
-/+ resource "aws_s3_bucket" "rds_backup" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::ruby-getting-started-rds-backup-20251230" -> (known after apply)
      ~ bucket                      = "ruby-getting-started-rds-backup-20251230" -> "ruby-getting-started-rds-backup" # forces replacement
      ~ bucket_domain_name          = "ruby-getting-started-rds-backup-20251230.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "ruby-getting-started-rds-backup-20251230.s3.ap-northeast-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2M4EHUR26P7ZW" -> (known after apply)
      ~ id                          = "ruby-getting-started-rds-backup-20251230" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "rds.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::ruby-getting-started-rds-backup-20251230/*"
                      - Sid       = "AllowRDSToWriteBackups"
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "rds.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::ruby-getting-started-rds-backup-20251230"
                      - Sid       = "AllowRDSToListBucket"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "ap-northeast-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "production"
            "Name"        = "ruby-getting-started RDS Backup Bucket"
            "Project"     = "ruby-getting-started"
            "Purpose"     = "RDS Database Backups"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "fb5d7bd996aff351ae8a5ede1e877fc5064c9fd4cbcf71d1a72015e596fd4026" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "delete-old-backups" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 365 -> null
              - expired_object_delete_marker = false -> null
            }
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_lifecycle_configuration.rds_backup must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "rds_backup" {
      ~ bucket = "ruby-getting-started-rds-backup-20251230" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "ruby-getting-started-rds-backup-20251230" -> (known after apply)

      ~ rule {
            id     = "delete-old-backups"
            # (1 unchanged attribute hidden)

          ~ expiration {
              ~ expired_object_delete_marker = false -> (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
    }

  # aws_s3_bucket_policy.rds_backup must be replaced
-/+ resource "aws_s3_bucket_policy" "rds_backup" {
      ~ bucket = "ruby-getting-started-rds-backup-20251230" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "ruby-getting-started-rds-backup-20251230" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "rds.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::ruby-getting-started-rds-backup-20251230/*"
                      - Sid       = "AllowRDSToWriteBackups"
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "rds.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::ruby-getting-started-rds-backup-20251230"
                      - Sid       = "AllowRDSToListBucket"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # aws_s3_bucket_public_access_block.rds_backup must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "rds_backup" {
      ~ bucket                  = "ruby-getting-started-rds-backup-20251230" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "ruby-getting-started-rds-backup-20251230" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_server_side_encryption_configuration.rds_backup must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "rds_backup" {
      ~ bucket = "ruby-getting-started-rds-backup-20251230" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "ruby-getting-started-rds-backup-20251230" -> (known after apply)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.rds_backup must be replaced
-/+ resource "aws_s3_bucket_versioning" "rds_backup" {
      ~ bucket = "ruby-getting-started-rds-backup-20251230" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "ruby-getting-started-rds-backup-20251230" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 11 to add, 0 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details ><summary>Terraform plan validation check (ruby-getting-started-terraform)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
|  CHANGE  |                            RESOURCE                             |
|----------|-----------------------------------------------------------------|
| add      | `aws_iam_role.rds_backup`                                       |
|          | `aws_iam_role_policy.rds_backup`                                |
|          | `aws_kms_alias.rds_backup`                                      |
|          | `aws_kms_key.rds_backup`                                        |
|          | `aws_kms_key_policy.rds_backup`                                 |
| recreate | `aws_s3_bucket.rds_backup`                                      |
|          | `aws_s3_bucket_lifecycle_configuration.rds_backup`              |
|          | `aws_s3_bucket_policy.rds_backup`                               |
|          | `aws_s3_bucket_public_access_block.rds_backup`                  |
|          | `aws_s3_bucket_server_side_encryption_configuration.rds_backup` |
|          | `aws_s3_bucket_versioning.rds_backup`                           |
| delete   | `aws_iam_role.rds_s3_export`                                    |
|          | `aws_iam_role_policy.rds_s3_export`                             |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p ruby-getting-started-terraform
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>